app/controllers/api/v1/registrations_controller.rb

   def create
     begin
       if params[:password] == params[:password_confirmation]
          @user = User.new
          @user.email = params[:email]
          @user.password = params[:password]
          @user.password_confirmation = params[:password_confirmation]
          @user.role = 2
          if @user.save
            @std = Student.new
            @std.name = params[:name]
            @std.roll_number = params[:roll_number]
            @std.batch_number = params[:batch_number]
            @std.semseter = params[:semseter]
            @std.department = params[:name]
            @std.user_id = @user.id
            if @std.save
---
INSERT INTO "users" ("role", "email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
INSERT INTO "students" ("name", "roll_number", "batch_number", "semseter", "department", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)