app/controllers/api/v1/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "bus@gmail.com"], ["LIMIT", 1]]
---
  def create
    begin
      @user = User.find_by_email(params[:email])