app/controllers/buses_controller.rb

  def edit
    @bus = Bus.find(params[:id])
    @user = User.find(@bus.user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @bus = Bus.new(bus_params)
    @user = User.new
    @user.email = params[:bus][:email]
    @user.password = params[:bus][:password]
    @user.password_confirmation = params[:bus][:password_confirmation]
    @user.role = 1
    if @user.save
---
INSERT INTO "buses" ("current_lat", "current_lan", "description", "evening_start_time", "evening_end_time", "morning_start_time", "morning_end_time", "bus_number", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "users" ("role", "email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)