app/controllers/homes_controller.rb

SELECT COUNT(*) FROM "users" WHERE "users"."role" = ?  [["role", 1]]
---
  def index
    @drivers = User.where(role: 1).count